wisteria-1c/Конфигурация/Catalogs/СегментыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>СегментыНоменклатуры</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СхемаКомпоновкиДанных</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Обновляемый</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасширенныйРежимРедактирования</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяШаблонаСКД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

wisteria-1c/Конфигурация/InformationRegisters/ФормированиеСегментовНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ФормированиеСегментовНоменклатуры</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаПоследнегоФормирования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сегмент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СегментыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

wisteria-1c/Конфигурация/Enums/СпособыДобавленияВСегмент.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>СпособыДобавленияВСегмент</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Вручную</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоПравилам</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

wisteria-1c/Конфигурация/ChartsOfCharacteristicTypes/ДополнительныеРеквизитыИСведения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<ChartOfCharacteristicTypes>
		<Properties>
			<Name>ДополнительныеРеквизитыИСведения</Name>
			<Type>
				<v8:Type>cfg:CatalogRef.Лиды</v8:Type>
				<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
				<v8:Type>cfg:CatalogRef.ЗначенияСвойствОбъектов</v8:Type>
				<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
				<v8:Type>cfg:CatalogRef.ЗначенияСвойствОбъектовИерархия</v8:Type>
				<v8:Type>xs:boolean</v8:Type>
				<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
				<v8:Type>cfg:CatalogRef.ТранспортныеСредства</v8:Type>
				<v8:Type>xs:string</v8:Type>
				<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
				<v8:Type>xs:dateTime</v8:Type>
				<v8:Type>xs:decimal</v8:Type>
				<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
				<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
				<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
				<v8:NumberQualifiers>
					<v8:Digits>17</v8:Digits>
					<v8:FractionDigits>5</v8:FractionDigits>
				</v8:NumberQualifiers>
				<v8:StringQualifiers>
					<v8:Length>1024</v8:Length>
				</v8:StringQualifiers>
				<v8:DateQualifiers>
					<v8:DateFractions>DateTime</v8:DateFractions>
				</v8:DateQualifiers>
			</Type>
			<Hierarchical>false</Hierarchical>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Виден</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВладелецДополнительныхЗначений</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьВВидеГиперссылки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительныеЗначенияИспользуются</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительныеЗначенияСВесом</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Доступен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заголовок</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>75</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаголовокФормыВыбораЗначения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаголовокФормыВыбораЗначенияЯзык1</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаголовокФормыВыбораЗначенияЯзык2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаголовокФормыЗначения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаголовокФормыЗначенияЯзык1</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаголовокФормыЗначенияЯзык2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаголовокЯзык1</Name>
					<Comment>АПК:58</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>75</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаголовокЯзык2</Name>
					<Comment>АПК:58</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>75</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаполнятьОбязательно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторДляФормул</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МногострочноеПолеВвода</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаборСвойств</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаборыДополнительныхРеквизитовИСведений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подсказка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодсказкаЯзык1</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодсказкаЯзык2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФорматСвойства</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоДополнительноеСведение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСвойства</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыСвойств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦветСвойства</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЦветаСвойств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЗависимостиДополнительныхРеквизитов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЗависимоеСвойство</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>25</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаборСвойств</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НаборыДополнительныхРеквизитовИСведений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Реквизит</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>99</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Условие</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Представления</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КодЯзыка</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Заголовок</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>75</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подсказка</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗаголовокФормыЗначения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗаголовокФормыВыбораЗначения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</ChartOfCharacteristicTypes>
</MetaDataObject>

wisteria-1c/Конфигурация/Catalogs/СегментыНоменклатуры/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИспользоватьХарактеристикиНоменклатуры = ПолучитьФункциональнуюОпцию("ИспользоватьХарактеристики");
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		СКД = Объект.Ссылка.СхемаКомпоновкиДанных.Получить();
		Если ТипЗнч(СКД) <> Тип("СхемаКомпоновкиДанных") Тогда
			СКД = Справочники.СегментыНоменклатуры.ПолучитьМакет("СегментыНоменклатуры");
		КонецЕсли;
		Если ЗначениеЗаполнено(Объект.ИмяШаблонаСКД) Тогда
			ТекущийШаблонСхемыКомпоновкиДанных = Объект.ИмяШаблонаСКД;
		Иначе
			ТекущийШаблонСхемыКомпоновкиДанных = 
				Элементы.ТекущийШаблонСхемыКомпоновкиДанных.СписокВыбора.НайтиПоЗначению("Основная");
		КонецЕсли;
	Иначе
		СКД = Справочники.СегментыНоменклатуры.ПолучитьМакет("СегментыНоменклатуры");
		ТекущийШаблонСхемыКомпоновкиДанных = 
			Элементы.ТекущийШаблонСхемыКомпоновкиДанных.СписокВыбора.НайтиПоЗначению("Основная");
	КонецЕсли;
	
	Если ТекущийШаблонСхемыКомпоновкиДанных = "Основная" Тогда

		НоваяСКД = Справочники.СегментыНоменклатуры.ПолучитьМакет("СегментыНоменклатуры");
		РаботаССегментами.ОчиститьНастройкиКомпоновкиДанных(НоваяСКД.НастройкиПоУмолчанию);
		РаботаССегментами.СкопироватьНастройкиКомпоновкиДанных(НоваяСКД.НастройкиПоУмолчанию, СКД.НастройкиПоУмолчанию);
		
		НаборСвойств_Справочник_Номенклатура = УправлениеСвойствами.НаборСвойствПоИмени("Справочник_Номенклатура_Общие");
		НоваяСКД.Параметры.НаборСвойств_Справочник_Номенклатура.Значение = НаборСвойств_Справочник_Номенклатура;
		НоваяСКД.НастройкиПоУмолчанию.ПараметрыДанных.УстановитьЗначениеПараметра("НаборСвойств_Справочник_Номенклатура",
			НаборСвойств_Справочник_Номенклатура);

		АдресСхемыКомпоновкиДанных = ПоместитьВоВременноеХранилище(СКД);
		
		СКД = НоваяСКД;
		
	КонецЕсли;
	
	АдресТекущейСКД = ПоместитьВоВременноеХранилище(СКД, Новый УникальныйИдентификатор);	
	
	// Исходная СКД заменяется редактируемой СКД
	РаботаССегментами.СкопироватьСхемуКомпоновкиДанных(АдресРедактируемойСхемыКомпоновкиДанных, АдресТекущейСКД);
	
	// Инициализирование компоновщика настроек редактируемой СКД
	ЭтоСозданиеСегмента = НЕ ЗначениеЗаполнено(Объект.Ссылка);
	РаботаССегментами.ИнициализироватьКомпоновщикНастроек(КомпоновщикНастроек, 
		АдресРедактируемойСхемыКомпоновкиДанных,
		ЭтоСозданиеСегмента);
		
	ЗаполнитьПоляТаблицыОтбора();
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда	
		ЗаполнитьНоменклатуруВручную();
		ЗаполнитьСоставПоПравилам();
	КонецЕсли;
	
	РазрешеноРедактированиеСегмента = РаботаССегментами.РазрешеноРедактированиеСегментаНоменклатуры(Объект.Ссылка);

	ВвывестиБаннер();

	УправлениеФормой();

	КоличествоПодобранныхВручную = СвояНоменклатура.Количество();
	КоличествоПодобранныхПоПравилам = СоставНоменклатурыПоПравилам.Количество();
	
	АдаптацияТакси();
	АдаптацияМобильныйКлиент();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	КоличествоПодобранныхВручную = СвояНоменклатура.Количество();
	КоличествоПодобранныхПоПравилам = СоставНоменклатурыПоПравилам.Количество();	

КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	РаботаССегментами.ПоместитьНастройкиВСхемуКомпоновкиДанных(КомпоновщикНастроек, 
		АдресРедактируемойСхемыКомпоновкиДанных, АдресТекущейСКД);
		
	ТекущийОбъект.СхемаКомпоновкиДанных =
		Новый ХранилищеЗначения(ПолучитьИзВременногоХранилища(АдресТекущейСКД));
		
	ТекущийОбъект.ИмяШаблонаСКД = ТекущийШаблонСхемыКомпоновкиДанных;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	СписокНоменклатуры = РеквизитФормыВЗначение("СвояНоменклатура", Тип("ТаблицаЗначений"));
	МассивНоменклатуры = Новый Массив;
	
	Для Каждого СтрокаНоменклатуры Из СписокНоменклатуры Цикл
		СтрокаНоменклатуры = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(СтрокаНоменклатуры);
		МассивНоменклатуры.Добавить(СтрокаНоменклатуры);
	КонецЦикла;
	
	Справочники.СегментыНоменклатуры.ОбновитьСоставСегментаВручную(Объект.Ссылка, 
		МассивНоменклатуры);
	УправлениеФормой();

	КоличествоПодобранныхПоПравилам = СоставНоменклатурыПоПравилам.Количество();

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ПараметрОповещения = Новый Структура;
	ПараметрОповещения.Вставить("Сегмент", Объект.Ссылка);
	ПараметрОповещения.Вставить("Наименование", Объект.Наименование);
	
	Оповестить("СегментНоменклатуры_ПослеЗаписи", ПараметрОповещения, Объект.Ссылка);
	
	РезультатФоновогоЗадания = ФоновоеЗаданиеЗапустить();
	
	Если РезультатФоновогоЗадания = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	Если РезультатФоновогоЗадания.Статус = "Ошибка" Тогда
		ПоказатьОшибкиФормирования(РезультатФоновогоЗадания);
	ИначеЕсли РезультатФоновогоЗадания.Статус <> "Выполняется" Тогда 
		ОперацииПослеФормирования();
	Иначе
		Обработчик = Новый ОписаниеОповещения("ФоновоеЗаданиеВыполнено", ЭтотОбъект, Истина);
		ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
		ПараметрыОжидания.ВыводитьОкноОжидания = Истина;
		ПараметрыОжидания.ТекстСообщения = НСтр("ru = 'Сегмент формируется...'");
		ДлительныеОперацииКлиент.ОжидатьЗавершение(РезультатФоновогоЗадания, Обработчик, ПараметрыОжидания);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СтраницаВыбораПравилПриИзменении(Элемент)
	
	Если СтраницаВыбораПравил = 0 Тогда
		Элементы.СтраницыПравилаСегмента.ТекущаяСтраница = Элементы.СтраницаПравилаОтбора;
	Иначе
		Элементы.СтраницыПравилаСегмента.ТекущаяСтраница = Элементы.СтраницаФормированиеСостава;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомментарийНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	
	СтандартнаяОбработка = Ложь;
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияКомментария(
		Элемент.ТекстРедактирования, ЭтотОбъект, "Объект.Комментарий");
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбработатьДействиеИнформационногоСообщения(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено,
	СтандартнаяОбработка = Неопределено)

	ОбщегоНазначенияКлиент.ОбработатьДействиеИнформационногоСообщения(ЭтотОбъект, ЭлементИлиКоманда,
		НавигационнаяСсылка, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ТекущийШаблонСхемыКомпоновкиДанныхОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ВыбранноеЗначение <> Неопределено И ВыбранноеЗначение <> ТекущийШаблонСхемыКомпоновкиДанных Тогда
		
		ТекстВопроса = НСтр("ru='Текущие настройки будут потеряны. Продолжить?'");
		
		Если ВыбранноеЗначение = "Произвольная" Тогда
			ТекстМассив = Новый Массив;
			ТекстМассив.Добавить(НСтр("ru = 'Схема будет загружена из файла.'"));
			ТекстМассив.Добавить(ТекстВопроса);
			ТекстВопроса = СтрСоединить(ТекстМассив, Символы.НПП);
		КонецЕсли;
		
		ИмяПроцедурыЗавершения = "ТекущийШаблонСхемыКомпоновкиДанныхОбработкаВыбораЗавершение";
		ЗначениеШаблона = Новый Структура("ВыбранноеЗначение", ВыбранноеЗначение);
		
		ОповещениеПослеВопроса = Новый ОписаниеОповещения(ИмяПроцедурыЗавершения, ЭтотОбъект, ЗначениеШаблона);
		ПоказатьВопрос(ОповещениеПослеВопроса, ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Нет);
		
		СтандартнаяОбработка = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПоляОтбора

&НаКлиенте
Процедура ПоляОтбораВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если НЕ РазрешеноРедактированиеСегмента Тогда
		Возврат;
	КонецЕсли;
	
	Если Элемент.ТекущиеДанные.ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;

	УстановитьОтборСервер(Элемент.ТекущиеДанные.Значение, Элемент.ТекущиеДанные.ЭтоПараметр,
		Элемент.ТекущиеДанные.ТипЗначенияПоля);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыКомпоновщикНастроекНастройкиОтборДоступныеПоляОтбора

&НаКлиенте
Процедура КомпоновщикНастроекНастройкиОтборДоступныеПоляОтбораПриНаведении(Элемент, Строка, Поле)
	
	Если Строка = Неопределено Тогда
		Элементы.КомпоновщикНастроекНастройкиОтборДоступныеПоляОтбораВыбратьПолеОтбора.Видимость = Ложь;
		Возврат;
	КонецЕсли;
	
	ОбъектПоляОтбора = КомпоновщикНастроек.Настройки.Отбор.ДоступныеПоляОтбора.ПолучитьОбъектПоИдентификатору(Строка);
	Элементы.КомпоновщикНастроекНастройкиОтборДоступныеПоляОтбораВыбратьПолеОтбора.Видимость = Не ОбъектПоляОтбора.Папка;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыКомпоновщикНастроекНастройкиОтбор
&НаКлиенте
Процедура КомпоновщикНастроекНастройкиОтборПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, 
		СтандартнаяОбработка, Строка, Поле)
		
	Если НЕ РазрешеноРедактированиеСегмента Тогда
		Возврат;
	КонецЕсли;
		
	Если ПараметрыПеретаскивания.Значение.Количество() > 0 
		И ТипЗнч(ПараметрыПеретаскивания.Значение[0]) = Тип("ДанныеФормыЭлементДерева") Тогда
		СтандартнаяОбработка = Ложь;
		Для Каждого ДоступноеПравило Из ПараметрыПеретаскивания.Значение Цикл
			Если ДоступноеПравило.ЭтоГруппа Тогда
				ПараметрыПеретаскивания.Действие = ДействиеПеретаскивания.Отмена;
				Возврат;
			КонецЕсли;
		КонецЦикла;
		ПараметрыПеретаскивания.Действие = ДействиеПеретаскивания.Выбор;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура КомпоновщикНастроекНастройкиОтборПеретаскивание(Элемент, ПараметрыПеретаскивания, 
	СтандартнаяОбработка, Строка, Поле)
	
	СтандартнаяОбработка = Ложь;
	Если ПараметрыПеретаскивания.Значение.Количество() = 0 
		ИЛИ ТипЗнч(ПараметрыПеретаскивания.Значение[0]) <> Тип("ДанныеФормыЭлементДерева") Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого ДоступноеПравило Из ПараметрыПеретаскивания.Значение Цикл
		УстановитьОтборСервер(ДоступноеПравило.Значение, ДоступноеПравило.ЭтоПараметр, ДоступноеПравило.ТипЗначенияПоля);
	КонецЦикла;
	
	Модифицированность = Истина;

КонецПроцедуры

&НаКлиенте
Процедура КомпоновщикНастроекНастройкиОтборОкончаниеПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка)
	
	Если ПараметрыПеретаскивания.Значение.Количество() > 0  Тогда
		
		СтандартнаяОбработка = Ложь;
		Для Каждого ДоступноеПравило Из ПараметрыПеретаскивания.Значение Цикл
			Если СтрНайти(Строка(ДоступноеПравило.ЛевоеЗначение), "ПараметрыДанных") > 0 Тогда
				ПараметрыПеретаскивания.Действие = ДействиеПеретаскивания.Отмена;
				ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Параметр не может участвовать в группе'"));
				Возврат;
			КонецЕсли;
		КонецЦикла;
		ПараметрыПеретаскивания.Действие = ДействиеПеретаскивания.Перемещение;
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура КомпоновщикНастроекНастройкиОтборПриАктивизацииСтроки(Элемент)
		
	ЭтоПараметр = СтрНайти(Строка(Элемент.ТекущиеДанные.ЛевоеЗначение), "ПараметрыДанных") > 0;
	Элементы.КомпоновщикНастроекНастройкиОтборКонтекстноеМенюСгруппироватьЭлементыОтбора.Видимость = НЕ ЭтоПараметр;
	Элементы.КомпоновщикНастроекНастройкиОтборКонтекстноеМенюРазгруппировать.Видимость = НЕ ЭтоПараметр;
	
КонецПроцедуры

&НаКлиенте
Процедура КомпоновщикНастроекНастройкиОтборПриИзменении(Элемент)
	УправлениеФормой();
КонецПроцедуры

&НаКлиенте
Процедура КомпоновщикНастроекНастройкиОтборПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	ТипГруппы = Неопределено;
	ТекущиеДанные.Свойство("ТипГруппы", ТипГруппы);
	
	Если Копирование Тогда
		Если ТипГруппы = Неопределено Тогда
			НовыйЭлементОтбора = КомпоновщикНастроек.Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			НовыйЭлементОтбора.ЛевоеЗначение = ТекущиеДанные.ЛевоеЗначение;	
			НовыйЭлементОтбора.Использование = Истина;
			НовыйЭлементОтбора.ВидСравнения = ТекущиеДанные.ВидСравнения;
			НовыйЭлементОтбора.ПравоеЗначение = ТекущиеДанные.ПравоеЗначение; 
		КонецЕсли;
		
		Если ТипГруппы <> Неопределено Тогда
			НовыйЭлементОтбора = КомпоновщикНастроек.Настройки.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
			НовыйЭлементОтбора.ТипГруппы = ТекущиеДанные.ТипГруппы;
		КонецЕсли;
		
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСвояНоменклатура

&НаКлиенте
Процедура СвояНоменклатураПриИзменении(Элемент)
	
	КоличествоПодобранныхВручную = СвояНоменклатура.Количество();
КонецПроцедуры

&НаКлиенте
Процедура СвояНоменклатураОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	НоваяНоменклатура = СвояНоменклатура.Добавить();
	НоваяНоменклатура.Номенклатура = ВыбранноеЗначение;
	УправлениеФормой();
	
КонецПроцедуры

&НаКлиенте
Процедура СвояНоменклатураПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	УправлениеФормой();
КонецПроцедуры

&НаКлиенте
Процедура СвояНоменклатураПослеУдаления(Элемент)
	УправлениеФормой();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыбратьПолеОтбора(Команда)
	
	ТекущаяСтрока = Элементы.КомпоновщикНастроекНастройкиОтборДоступныеПоляОтбора.ТекущаяСтрока;
	ОбъектПоляОтбора = КомпоновщикНастроек.Настройки.Отбор.ДоступныеПоляОтбора.ПолучитьОбъектПоИдентификатору(ТекущаяСтрока);
	ЭтоПараметр = Не ОбъектПоляОтбора.Папка; 

	ТипЗначенияПоля = ОбъектПоляОтбора.ТипЗначения;
	УстановитьОтборСервер(ОбъектПоляОтбора.Поле, ЭтоПараметр, ТипЗначенияПоля);
	
КонецПроцедуры

&НаКлиенте
Процедура КомментарийИзменить(Команда)
	
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияКомментария(
		Объект.Комментарий, ЭтотОбъект, "Объект.Комментарий");
	
КонецПроцедуры

&НаКлиенте
Процедура ПодобратьНоменклатуруВручную(Команда)
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("РежимВыбора", Истина);
	ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", Ложь);
	
	ОткрытьФорму("Справочник.Номенклатура.ФормаВыбора", ПараметрыФормы, Элементы.СвояНоменклатура);
КонецПроцедуры

&НаКлиенте
Процедура СформироватьСегмент(Команда)
	Записать();
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьСКД(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗагрузитьСхемуИзФайлаВыборФайла", ЭтотОбъект);

	ПараметрыЗагрузки = ФайловаяСистемаКлиент.ПараметрыЗагрузкиФайла();
	
	ПараметрыЗагрузки.Диалог.Заголовок 		= НСтр("ru = 'Выбор схемы компоновки данных'");
	ПараметрыЗагрузки.Диалог.Фильтр 		= НСтр("ru = 'Схема компоновки данных (*.xml)|*.xml'");
	ПараметрыЗагрузки.ИдентификаторФормы 	= УникальныйИдентификатор;	
	
	ФайловаяСистемаКлиент.ЗагрузитьФайл(ОписаниеОповещения, ПараметрыЗагрузки);

КонецПроцедуры

&НаКлиенте
Процедура РасширенныйРежимРедактирования(Команда)
	Элементы.ФормаРасширенныйРежимРедактирования.Пометка = НЕ Элементы.ФормаРасширенныйРежимРедактирования.Пометка;
	Объект.РасширенныйРежимРедактирования = Элементы.ФормаРасширенныйРежимРедактирования.Пометка;
	УправлениеФормой();
КонецПроцедуры

&НаКлиенте
Процедура КопироватьСтроки(Команда)
	
	Если КопированиеТабличнойЧастиКлиент.МожноКопироватьСтроки(СвояНоменклатура, Элементы.СвояНоменклатура.ТекущиеДанные) Тогда
		
		КоличествоСкопированных = 0;
		
		КопироватьСтрокиНаСервере(КоличествоСкопированных);
		КопированиеТабличнойЧастиКлиент.ОповеститьПользователяОКопированииСтрок(КоличествоСкопированных);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВставитьСтроки(Команда)
	
	КоличествоСкопированных = 0;
	КоличествоВставленных 	= 0;
	
	ВставитьСтрокиНаСервере(КоличествоСкопированных, КоличествоВставленных);
	КопированиеТабличнойЧастиКлиент.ОповеститьПользователяОВставкеСтрок(КоличествоСкопированных, КоличествоВставленных);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура АдаптацияТакси()
	
	ЭтоВариантИнтерфейса85 = ОбщегоНазначенияКлиентСервер.ЭтоВариантИнтерфейса85();
	Если ЭтоВариантИнтерфейса85 Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.КомпоновщикНастроекНастройкиОтборДоступныеПоляОтбораВыбратьПолеОтбора.Отображение =
		ОтображениеКнопки.Текст;
		
	Элементы.КомпоновщикНастроекНастройкиОтборДоступныеПоляОтбора.Ширина = 20;
	
КонецПроцедуры

&НаСервере
Процедура АдаптацияМобильныйКлиент()
	
	Если Не ОбщегоНазначения.ЭтоМобильныйКлиент() Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.ПоляОтбора.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Авто;
	Элементы.КомпоновщикНастроекНастройкиОтборДоступныеПоляОтбора.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Авто;
	Элементы.КомпоновщикНастроекНастройкиОтбор.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Авто;
	
КонецПроцедуры

&НаСервере
Процедура КопироватьСтрокиНаСервере(КоличествоСкопированных)
	
	КопированиеТабличнойЧастиСервер.Копировать(
		СвояНоменклатура, 
		Элементы.СвояНоменклатура.ВыделенныеСтроки, 
		КоличествоСкопированных);
	
КонецПроцедуры

&НаСервере
Процедура ВставитьСтрокиНаСервере(КоличествоСкопированных, КоличествоВставленных) Экспорт
	
	Справочники.СегментыНоменклатуры.ВставитьСтроки(
		ЭтотОбъект,
		"СвояНоменклатура",
		Элементы,
		КоличествоСкопированных,
		КоличествоВставленных);
	
КонецПроцедуры

&НаСервере
Процедура ПоказатьОшибкиФормирования(Знач ДанныеОшибки)
	
	Если ТипЗнч(ДанныеОшибки) = Тип("Структура") Тогда
		КраткоеПредставлениеОшибки = ДанныеОшибки.КраткоеПредставлениеОшибки;
		ПодробноеПредставлениеОшибки = ДанныеОшибки.ПодробноеПредставлениеОшибки;
	Иначе
		КраткоеПредставлениеОшибки = ДанныеОшибки;
		ПодробноеПредставлениеОшибки = "";
	КонецЕсли;
	
	Если ПустаяСтрока(ПодробноеПредставлениеОшибки) Тогда
		Возврат;
	КонецЕсли;
	
		Уровень = УровеньЖурналаРегистрации.Ошибка;
	ИмяСобытия = НСтр("ru = 'Формирование сегмента номенклатуры'",
		ОбщегоНазначения.КодОсновногоЯзыка());
		
	ЗаписьЖурналаРегистрации(ИмяСобытия, Уровень, , Объект.Ссылка,
			ПодробноеПредставлениеОшибки);
			
	ВызватьИсключение ПодробноеПредставлениеОшибки;
	
КонецПроцедуры

&НаКлиенте
Процедура ТекущийШаблонСхемыКомпоновкиДанныхОбработкаВыбораЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	ТекущийШаблонСхемыКомпоновкиДанных = ДополнительныеПараметры.ВыбранноеЗначение;
	
	Если ТекущийШаблонСхемыКомпоновкиДанных = "Произвольная" Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("ЗагрузитьСхемуИзФайлаВыборФайла", ЭтотОбъект);
		
		ПараметрыЗагрузки = ФайловаяСистемаКлиент.ПараметрыЗагрузкиФайла();
		
		ПараметрыЗагрузки.Диалог.Заголовок 		= НСтр("ru = 'Выбор схемы компоновки данных'");
		ПараметрыЗагрузки.Диалог.Фильтр 		= НСтр("ru = 'Схема компоновки данных (*.xml)|*.xml'");
		ПараметрыЗагрузки.ИдентификаторФормы 	= УникальныйИдентификатор;	
		
		ФайловаяСистемаКлиент.ЗагрузитьФайл(ОписаниеОповещения, ПараметрыЗагрузки);
	Иначе
		ИзменитьСхемуНаОсновную();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборСервер(ПолеОтбора, ЭтоПараметр, ТипЗначенияПоля)
	
	НовыйЭлементОтбора = КомпоновщикНастроек.Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	НовыйЭлементОтбора.ЛевоеЗначение = ПолеОтбора;	
	НовыйЭлементОтбора.Использование = Истина;
	Если ТипЗначенияПоля.СодержитТип(Тип("Число")) Тогда
		НовыйЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.БольшеИлиРавно;
	ИначеЕсли ТипЗначенияПоля.СодержитТип(Тип("Строка")) Тогда
		НовыйЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Содержит;
	Иначе
		НовыйЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;	
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ФоновоеЗаданиеВыполнено(Результат, Параметры) Экспорт
	
	Если Результат = Неопределено Тогда 
		Возврат;
	КонецЕсли;
			
	ОперацииПослеФормирования();
	
КонецПроцедуры

&НаСервере
Функция ФоновоеЗаданиеЗапустить()
	
	Попытка
		ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
		ПараметрыВыполнения.ЗапуститьВФоне = Истина;

		ПараметрыФормированияСегмента = Новый Структура;
		ПараметрыФормированияСегмента.Вставить("Сегмент", Объект.Ссылка);	
		
		РезультатФоновогоЗадания = ДлительныеОперации.ВыполнитьВФоне(
			"РаботаССегментами.СформироватьСоставСегментаВФоне",ПараметрыФормированияСегмента,
			ПараметрыВыполнения);
	Исключение
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		ТекстИсключения = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
		ВызватьИсключение ТекстИсключения;
	КонецПопытки;
	
	Возврат РезультатФоновогоЗадания;
	
КонецФункции

&НаКлиенте
Процедура ОперацииПослеФормирования()
	
	РасчетКоличестваИУправлениеФормой();
	ТекстШаблона = НСтр("ru = 'Сегмент успешно сформирован. Подобрано по правилам: %1, добавлено вручную: %2'");
	СтрокаШаблон = СтрШаблон(ТекстШаблона, КоличествоНоменклатурыПоПравилам, КоличествоНоменклатурыВручную);
	
	КоличествоПодобранныхПоПравилам = СоставНоменклатурыПоПравилам.Количество();
	
	ОбщегоНазначенияКлиент.СообщитьПользователю(СтрокаШаблон);	

КонецПроцедуры

&НаСервере
Процедура РасчетКоличестваИУправлениеФормой()
	РассчитатьКоличествоНоменклатурыВСегменте();
	УправлениеФормой();
КонецПроцедуры

&НаСервере
Процедура РассчитатьКоличествоНоменклатурыВСегменте()
	
	КоличествоНоменклатурыВручную = СвояНоменклатура.Количество();
	СоставНоменклатурыПоПравилам.Очистить();
	НоменклатураПоПравилам = Справочники.СегментыНоменклатуры.ПолучитьСоставСегмента(Объект.Ссылка,
		Перечисления.СпособыДобавленияВСегмент.ПоПравилам);
		
	Для Каждого НоменклатураСегмента Из НоменклатураПоПравилам Цикл
		НоваяСтрока = СоставНоменклатурыПоПравилам.Добавить();
		НоваяСтрока.Номенклатура = НоменклатураСегмента.Номенклатура;
		НоваяСтрока.Характеристика = НоменклатураСегмента.Характеристика;
	КонецЦикла;
	
	КоличествоНоменклатурыПоПравилам = СоставНоменклатурыПоПравилам.Количество();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоляТаблицыОтбора()
	
	Для Каждого ПолеОтбора Из КомпоновщикНастроек.Настройки.Отбор.ДоступныеПоляОтбора.Элементы Цикл
		
		Если Строка(ПолеОтбора.Поле) = "СлужебныеРеквизиты" Тогда
			Продолжить;
		КонецЕсли;
		
		Если Строка(ПолеОтбора.Поле) = "ПараметрыДанных" Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокиПервыйУровень = ДоступныеПравила.ПолучитьЭлементы();
		НоваяГруппаПравил = СтрокиПервыйУровень.Добавить();
		НоваяГруппаПравил.Значение = ПолеОтбора.Поле;
		НоваяГруппаПравил.Представление = ПолеОтбора.Заголовок;
		НоваяГруппаПравил.ЭтоГруппа = Истина;
		НоваяГруппаПравил.Картинка = 2;
		
		СтрокиВторойУровень = НоваяГруппаПравил.ПолучитьЭлементы();
		ДобавитьПоляПараметровДанных(СтрокиВторойУровень, НоваяГруппаПравил);

		Для Каждого ПравилоОтбора Из ПолеОтбора.Элементы Цикл
			НовоеПравило = СтрокиВторойУровень.Добавить();
			НовоеПравило.Значение = ПравилоОтбора.Поле;
			НовоеПравило.Представление = ПравилоОтбора.Заголовок;
			НовоеПравило.ЭтоГруппа = Ложь;
			НовоеПравило.Картинка = 5;
			НовоеПравило.ТипЗначенияПоля = ПравилоОтбора.ТипЗначения;
		КонецЦикла;
		
		Если Строка(ПолеОтбора.Поле) = "Реквизиты" Тогда
			ДобавитьДополнительныеРеквизиты(СтрокиВторойУровень);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьПоляПараметровДанных(ГруппаДобавления, ГруппаРодитель)
	
	ЭлементыПравилОтбора = КомпоновщикНастроек.Настройки.Отбор.ДоступныеПоляОтбора.Элементы;
	ПараметрыПравилОтбора = ЭлементыПравилОтбора[ЭлементыПравилОтбора.Количество() - 1];	
	
	Для Каждого Параметр Из ПараметрыПравилОтбора.Элементы Цикл
		
		Если СтрНайти(Строка(Параметр.Поле), Строка(ГруппаРодитель.Значение)) = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		НовоеПравилоУточнения = ГруппаДобавления.Добавить();
		НовоеПравилоУточнения.Значение = Параметр.Поле;
		ЗаголовокПравила = Прав(Параметр.Заголовок, СтрДлина(Параметр.Заголовок) - СтрНайти(Параметр.Заголовок, "."));
		НовоеПравилоУточнения.Представление = ЗаголовокПравила;
		НовоеПравилоУточнения.ЭтоГруппа = Ложь;
		НовоеПравилоУточнения.Картинка = 5;
		НовоеПравилоУточнения.ЭтоПараметр = Истина;
		НовоеПравилоУточнения.ТипЗначенияПоля = Параметр.ТипЗначения;
		
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ДобавитьДополнительныеРеквизиты(ГруппаДобавления)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДополнительныеРеквизитыИСведения.Ссылка КАК Ссылка,
	|	ДополнительныеРеквизитыИСведения.Заголовок КАК Заголовок,
	|	ДополнительныеРеквизитыИСведения.ТипЗначения КАК ТипЗначения,
	|	ДополнительныеРеквизитыИСведения.ФорматСвойства КАК ФорматСвойства
	|ИЗ
	|	ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения КАК ДополнительныеРеквизитыИСведения
	|ГДЕ
	|	ДополнительныеРеквизитыИСведения.ПометкаУдаления = ЛОЖЬ
	|	И ДополнительныеРеквизитыИСведения.ЭтоДополнительноеСведение = ЛОЖЬ
	|	И ДополнительныеРеквизитыИСведения.НаборСвойств = &НаборСвойств
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДополнительныеРеквизитыИСведения.Заголовок";
	
	Запрос.УстановитьПараметр("НаборСвойств", УправлениеСвойствами.НаборСвойствПоИмени("Справочник_Номенклатура_Общие"));
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		НовоеПравило = ГруппаДобавления.Добавить();
		НовоеПравило.Значение = ПолеОтбораДополнительногоРеквизита(Выборка.Заголовок, Выборка.ТипЗначения, Выборка.Ссылка);
		НовоеПравило.Представление = Выборка.Заголовок;
		НовоеПравило.ЭтоГруппа = Ложь;
		НовоеПравило.Картинка = 5;
		НовоеПравило.ТипЗначенияПоля = Выборка.ТипЗначения;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПолеОтбораДополнительногоРеквизита(Заголовок, ТипЗначения, Ссылка, УточнениеАдреса = Ложь)
	
	ПолеДопРеквизита = СтрШаблон("Служебные реквизиты.Ссылка.%1", Заголовок);
	
	Для Каждого ГруппаПараметров Из КомпоновщикНастроек.Настройки.Отбор.ДоступныеПоляОтбора.Элементы Цикл
		
		Если Строка(ГруппаПараметров.Поле) <> "СлужебныеРеквизиты" Тогда
			Продолжить;
		КонецЕсли;
		
		Для Каждого ЭлементГруппы Из ГруппаПараметров.Элементы Цикл
			
			Если Строка(ЭлементГруппы.Поле) <> "СлужебныеРеквизиты.Ссылка" Тогда
				Продолжить;
			КонецЕсли;
			
			Для Каждого РеквизитГруппы Из ЭлементГруппы.Элементы Цикл
				
				Если РеквизитГруппы.Заголовок <> ПолеДопРеквизита 
					ИЛИ РеквизитГруппы.ТипЗначения <> ТипЗначения Тогда
					Продолжить;
				КонецЕсли;
				
				Возврат РеквизитГруппы.Поле; 
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат Ссылка;
	
КонецФункции

#Область ЗагрузкаСКДИзФайла

&НаСервере
Процедура ИзменитьСхемуНаОсновную()
	
	ТекущийШаблонСхемыКомпоновкиДанных = "Основная";
	СКД = Справочники.СегментыНоменклатуры.ПолучитьМакет("СегментыНоменклатуры");
	СКД.НастройкиПоУмолчанию.Отбор.Элементы.Очистить();
	ИзмененаСхемаКомпоновкиДанных(ЭтотОбъект, СКД);
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьСхемуИзФайлаНаСервере(ТекстФайла)
	
	Попытка
		
		ЧтениеXML = Новый ЧтениеXML();
		ЧтениеXML.УстановитьСтроку(ТекстФайла);
		СхемаКомпоновкиДанных = СериализаторXDTO.ПрочитатьXML(ЧтениеXML);
		ИзмененаСхемаКомпоновкиДанных(ЭтотОбъект, СхемаКомпоновкиДанных);
		
	Исключение
		
		ИмяСобытия = НСтр("ru = 'Выполнение операции'", ОбщегоНазначения.КодОсновногоЯзыка());
		ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка,,,
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьСхемуИзФайлаВыборФайла(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныеФайлы = Неопределено Тогда
		
		ИзменитьСхемуНаОсновную();
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			НСтр("ru = 'Файл не был выбран. Схема заменена на основную.'"));	
		Возврат;
		
	КонецЕсли;
	
	ТекстовыйДокумент = Новый ТекстовыйДокумент;
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ТекстовыйДокумент", ТекстовыйДокумент);
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ЗагрузитьСхемуИзФайлаВыборФайлаЗавершение", 
		ЭтотОбъект, 
		ДополнительныеПараметры);
	
	ТекстовыйДокумент.НачатьЧтение(ОповещениеОЗавершении, ВыбранныеФайлы.Имя, КодировкаТекста.UTF8);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьСхемуИзФайлаВыборФайлаЗавершение(ДополнительныеПараметры) Экспорт
	
	ТекстовыйДокумент = ДополнительныеПараметры.ТекстовыйДокумент;
	
	Текст = ТекстовыйДокумент.ПолучитьТекст();
	
	ОчиститьСообщения();
	ЗагрузитьСхемуИзФайлаНаСервере(Текст);

КонецПроцедуры

&НаСервере
Процедура ИзмененаСхемаКомпоновкиДанных(Форма, СхемаКомпоновкиДанных)
	
	// Получена схема из конструктора схемы компоновки данных
	Форма.Модифицированность = Истина;
	БылиИзменения = Ложь;
		
	УстановитьСхемуКомпоновкиДанных(Форма.АдресРедактируемойСхемыКомпоновкиДанных, 
		СхемаКомпоновкиДанных, 
		Истина, 
		БылиИзменения);
		
	// Компоновщик настроек инициализируется редактируемой схемой
	РаботаССегментами.ИнициализироватьКомпоновщикНастроек(Форма.КомпоновщикНастроек,
		Форма.АдресРедактируемойСхемыКомпоновкиДанных);
		
КонецПроцедуры

&НаСервереБезКонтекста
Процедура УстановитьСхемуКомпоновкиДанных(АдресПриемник, АдресСхемаИсточник, 
	ПроверятьНаИзменение = Ложь, БылиИзменения = Ложь)
	
	Если ЭтоАдресВременногоХранилища(АдресСхемаИсточник) Тогда
		СхемаКомпоновкиДанных = ПолучитьИзВременногоХранилища(АдресСхемаИсточник);
	Иначе
		СхемаКомпоновкиДанных = АдресСхемаИсточник;
	КонецЕсли;
	
	Если ПроверятьНаИзменение Тогда
		
		БылиИзменения = Ложь;
		
		Если ЭтоАдресВременногоХранилища(АдресПриемник) Тогда
			
			ТекущаяСКД = ПолучитьИзВременногоХранилища(АдресПриемник);
			БылиИзменения = ТипЗнч(ТекущаяСКД) = Тип("СхемаКомпоновкиДанных") 
				И РаботаССегментами.ПолучитьXML(СхемаКомпоновкиДанных) <> РаботаССегментами.ПолучитьXML(ТекущаяСКД);	
		Иначе
			
			БылиИзменения = Истина;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЭтоАдресВременногоХранилища(АдресПриемник) Тогда
		ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных, АдресПриемник);
	Иначе
		АдресПриемник = ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных, Новый УникальныйИдентификатор);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

&НаСервере
Процедура ЗаполнитьНоменклатуруВручную()
	
	СвояНоменклатура.Очистить();
	СоставНоменклатуры = Справочники.СегментыНоменклатуры.ПолучитьСоставСегмента(Объект.Ссылка, 
		Перечисления.СпособыДобавленияВСегмент.Вручную);
	
	Для Каждого Номенклатура Из СоставНоменклатуры Цикл
		НоваяСтрока = СвояНоменклатура.Добавить();
		НоваяСтрока.Номенклатура = Номенклатура.Номенклатура;
		НоваяСтрока.Характеристика = Номенклатура.Характеристика;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСоставПоПравилам()
	
	СоставНоменклатурыПоПравилам.Очистить();
	СоставНоменклатуры = Справочники.СегментыНоменклатуры.ПолучитьСоставСегмента(Объект.Ссылка, 
		Перечисления.СпособыДобавленияВСегмент.ПоПравилам);
	
	Для Каждого Номенклатура Из СоставНоменклатуры Цикл
		НоваяСтрока = СоставНоменклатурыПоПравилам.Добавить();
		НоваяСтрока.Номенклатура = Номенклатура.Номенклатура;
		НоваяСтрока.Характеристика = Номенклатура.Характеристика;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура УправлениеФормой()
	
	ТолькоПросмотр = НЕ РазрешеноРедактированиеСегмента;
	Элементы.Обновить.Доступность = РазрешеноРедактированиеСегмента;
	Элементы.ГруппаВажныеСообщения.Видимость = Не РазрешеноРедактированиеСегмента;
	Элементы.СвояНоменклатурыПодобратьНоменклатуруВручную.Доступность = РазрешеноРедактированиеСегмента;
	Элементы.КомандыКопированияСтрок.Доступность = РазрешеноРедактированиеСегмента;
	Элементы.СвояНоменклатураХарактеристика.Видимость = ИспользоватьХарактеристикиНоменклатуры;
	Элементы.СоставНоменклатурыПоПравиламХарактеристика.Видимость = ИспользоватьХарактеристикиНоменклатуры;
	
	Элементы.ФормаРасширенныйРежимРедактирования.Пометка = Объект.РасширенныйРежимРедактирования;
	
	Элементы.ГруппаРасширенныйРежим.Видимость			= Элементы.ФормаРасширенныйРежимРедактирования.Пометка;
	
	Если Объект.РасширенныйРежимРедактирования Тогда
		Элементы.СтраницыОтбор.ОтображениеСтраниц = ОтображениеСтраницФормы.Авто;
	Иначе
		Элементы.СтраницыОтбор.ОтображениеСтраниц = ОтображениеСтраницФормы.Нет;
	КонецЕсли;
	
	Элементы.ГруппаРасширенныеПоляОтбора.Видимость			= Элементы.ФормаРасширенныйРежимРедактирования.Пометка;
	Элементы.ГруппаПользовательскиеПоляОтбора.Видимость		= НЕ Элементы.ФормаРасширенныйРежимРедактирования.Пометка;
	Элементы.ГруппаОтборПользовательскийРежим.Видимость		= НЕ Элементы.ФормаРасширенныйРежимРедактирования.Пометка;
	
	Если Элементы.ФормаРасширенныйРежимРедактирования.Пометка Тогда
		Элементы.Переместить(Элементы.КомпоновщикНастроекНастройкиОтбор, Элементы.ОтборРасширенныйРежим);	
	Иначе
		Элементы.Переместить(Элементы.КомпоновщикНастроекНастройкиОтбор, Элементы.ГруппаОтборПользовательскийРежим);
	КонецЕсли;
	
	Элементы.ДекорацияСостояниеФормированияПоПравилам.Заголовок = ЗаголовокГруппыПодборВСегментПоПравилам();
	Элементы.СтраницаПараметры.Видимость = Элементы.ФормаРасширенныйРежимРедактирования.Пометка;
	
КонецПроцедуры

&НаСервере
Функция ЗаголовокГруппыПодборВСегментПоПравилам()

	Если КомпоновщикНастроек.Настройки.Отбор.Элементы.Количество() = 0 Тогда
		Уточнение = НСтр("ru = 'правила не выбраны'");
	Иначе
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ФормированиеСегментовНоменклатуры.Сегмент КАК Сегмент,
		|	ФормированиеСегментовНоменклатуры.ДатаПоследнегоФормирования КАК ДатаПоследнегоФормирования
		|ИЗ
		|	РегистрСведений.ФормированиеСегментовНоменклатуры КАК ФормированиеСегментовНоменклатуры
		|ГДЕ
		|	ФормированиеСегментовНоменклатуры.Сегмент = &Сегмент";
		
		Запрос.УстановитьПараметр("Сегмент", Объект.Ссылка); 
		Выборка = Запрос.Выполнить().Выбрать();
		ДатаОбновления = Дата(1, 1, 1, 0, 0, 0);
		
		Пока Выборка.Следующий() Цикл
			ДатаОбновления = Выборка.ДатаПоследнегоФормирования;
		КонецЦикла;

		Если ЗначениеЗаполнено(ДатаОбновления) Тогда
			Уточнение = СтрШаблон(НСтр("ru = 'сформирован %1, %2'"), СтрокаДаты(ДатаОбновления), ПредставлениеОбновления());
		Иначе
			Уточнение = НСтр("ru=' не сформирован'");
		КонецЕсли;

	КонецЕсли;
	
	Результат = СтрШаблон("%1 %2",
		НСтр("ru='Формирование по правилам:'"),
		Уточнение);
	
	Возврат Результат;
	
КонецФункции 

&НаСервере
Функция СтрокаДаты(ДатаОбновления)

	ДатаСтрокой = "";
	Если НачалоДня(ДатаОбновления) = НачалоДня(ТекущаяДатаСеанса()) Тогда
		ДатаСтрокой = СтрШаблон(НСтр("ru = 'сегодня в %1'"), Формат(ДатаОбновления, "ДФ = ЧЧ:мм"));
	Иначе
		ДатаСтрокой = Формат(ДатаОбновления, "ДФ = дд.ММ.гггг ЧЧ:мм");
	КонецЕсли;
	
	Возврат ДатаСтрокой;
	
КонецФункции

&НаСервере
Функция ПредставлениеОбновления()
	Если Объект.Обновляемый Тогда
		Возврат НСтр("ru = 'обновляется раз в сутки'");
	Иначе
		Возврат НСтр("ru = 'не обновляется'");
	КонецЕсли;
КонецФункции

&НаСервере
Процедура ВвывестиБаннер()

	ПараметрыВажногоСообщения = ОбщегоНазначения.ПараметрыВажногоСообщения();
	ПараметрыВажногоСообщения.Скрываемый = Ложь;
	ПараметрыВажногоСообщения.ТипСообщения = "Предупреждение";
	ПараметрыВажногоСообщения.Сообщение =
	НСтр("ru = 'Сегмент используется для предоставления скидки. Для редактирования состава сегмента обратитесь к администратору'");
	ПараметрыВажногоСообщения.КраткоеПредставление = НСтр("ru = 'Редактирование состава'");
	
	ОбщегоНазначения.ВставитьВажноеСообщение(ЭтотОбъект, ПараметрыВажногоСообщения, Элементы.ГруппаВажныеСообщения.Имя);
	ОбщегоНазначения.ВывестиСтатусыИВажныеСообщенияНаФорму(ЭтотОбъект);

КонецПроцедуры

#КонецОбласти
